phase-1/06-slow-backend/measurements/autocannon_output.log
➜  06-slow-backend git:(main) ✗ ./scripts/benchmark.sh
------------------------------------------------------------
Experiment 6: Slow Backend (Backpressure Propagation)
------------------------------------------------------------
Starting background measurements (NGINX status & Docker stats)...
Step 1: Baseline (Low Concurrency, 10 connections)
Running 10s test @ http://localhost:8080/
10 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 103 ms │ 106 ms │ 116 ms │ 211 ms │ 108.09 ms │ 11.25 ms │ 212 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 79      │ 79      │ 90      │ 100     │ 92      │ 6.19    │ 79      │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 15.2 kB │ 15.2 kB │ 17.3 kB │ 19.2 kB │ 17.7 kB │ 1.19 kB │ 15.2 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

930 requests in 10.02s, 177 kB read
Step 2: SATURATION (High Concurrency, 200 connections)
Running 15s test @ http://localhost:8080/
200 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max     │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼─────────┤
│ Latency │ 303 ms │ 410 ms │ 506 ms │ 563 ms │ 409.35 ms │ 99.07 ms │ 1470 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 443     │ 443     │ 498     │ 500     │ 482.4   │ 22.28   │ 443     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 85.1 kB │ 85.1 kB │ 95.7 kB │ 96.1 kB │ 92.7 kB │ 4.28 kB │ 85.1 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 15

7k requests in 15.04s, 1.39 MB read
Step 3: BREAKING POINT (1500 connections)
Running 15s test @ http://localhost:8080/
1500 connections


┌─────────┬────────┬─────────┬─────────┬─────────┬────────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev    │ Max     │
├─────────┼────────┼─────────┼─────────┼─────────┼────────────┼──────────┼─────────┤
│ Latency │ 483 ms │ 3062 ms │ 4033 ms │ 4333 ms │ 2774.84 ms │ 782.9 ms │ 5253 ms │
└─────────┴────────┴─────────┴─────────┴─────────┴────────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 439     │ 439     │ 493     │ 500     │ 486.67  │ 16.04   │ 439     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 84.4 kB │ 84.4 kB │ 94.7 kB │ 96.1 kB │ 93.5 kB │ 3.08 kB │ 84.3 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 15

9k requests in 15.09s, 1.4 MB read
------------------------------------------------------------
Benchmark Complete.

Stopping monitoring processes (PIDs: 89742, 89743)...
Done. All logs are saved in the 'measurements' directory.
➜  06-slow-backend git:(main) ✗